-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: localhost    Database: oasystem
-- ------------------------------------------------------
-- Server version	9.6.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ '8588053b-20d7-11f1-8950-60e9aa84e312:1-141';

--
-- Table structure for table `trx_expense_request`
--

DROP TABLE IF EXISTS `trx_expense_request`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `trx_expense_request` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '経費申請ID',
  `department_code` char(3) NOT NULL COMMENT '部門コード',
  `emp_id` char(3) NOT NULL COMMENT '社員ID',
  `emp_name` varchar(20) NOT NULL COMMENT '社員名',
  `request_date` date NOT NULL COMMENT '申請年月',
  `approval_status` char(1) NOT NULL COMMENT '承認状態',
  `remarks` varchar(255) DEFAULT NULL COMMENT '備考',
  `create_user_id` char(3) DEFAULT NULL COMMENT '登録者ID',
  `update_user_id` char(3) DEFAULT NULL COMMENT '更新者ID',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '登録時間',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新時間',
  `del_flg` char(1) DEFAULT '0' COMMENT '削除フラグ',
  `picture_url` varchar(2083) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='経費申請表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `trx_expense_request`
--

LOCK TABLES `trx_expense_request` WRITE;
/*!40000 ALTER TABLE `trx_expense_request` DISABLE KEYS */;
INSERT INTO `trx_expense_request` VALUES (1,'1','E01','田中太郎','2026-03-01','0','出張経費','U01','U01','2026-03-17 13:01:34','2026-03-30 17:01:36','0','/uploads/1'),(2,'2','E02','鈴木花子','2026-03-05','1','会議経費','U02','U02','2026-03-17 13:01:34','2026-03-27 10:48:03','0','/uploads/2'),(3,'2','E03','佐藤健','2026-03-06','0','出張経費','U03','U03','2026-03-17 13:01:34','2026-03-27 15:07:06','1',NULL),(4,'2','E04','高橋真央','2026-03-07','1','会議経費','U04','U04','2026-03-17 13:01:34','2026-04-02 15:07:23','1',NULL),(5,'1','E05','伊藤翔','2026-03-08','0','出張経費','U05','U05','2026-03-17 13:01:34','2026-04-02 15:07:27','1',NULL),(6,'1','E06','中村葵','2026-03-09','1','会議経費','U06','U06','2026-03-17 13:01:34','2026-04-01 11:07:01','1',NULL),(7,'2','E07','小林潤','2026-03-10','0','出張経費','U07','U07','2026-03-17 13:01:34','2026-04-02 15:07:27','1',NULL),(8,'1','E08','山本麗','2026-03-11','1','会議経費','U08','U08','2026-03-17 13:01:34','2026-04-01 11:07:10','1',NULL),(9,'2','E09','加藤健太','2026-03-12','0','出張経費','U09','U09','2026-03-17 13:01:34','2026-04-02 15:08:21','1',NULL),(10,'2','E10','吉田彩','2026-03-13','1','会議経費','U10','U10','2026-03-17 13:01:34','2026-04-02 15:08:55','1',NULL),(11,'1','E11','井上翔太','2026-03-14','0','出張経費','U11','U11','2026-03-17 13:01:34','2026-04-02 15:08:55','1',NULL),(12,'1','E12','松本真理','2026-03-15','1','会議経費','U12','U12','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(13,'1','E13','村上大輔','2026-03-16','0','出張経費','U13','U13','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(14,'1','E14','橋本美咲','2026-03-17','1','会議経費','U14','U14','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(15,'1','E15','斎藤拓也','2026-03-18','0','出張経費','U15','U15','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(16,'2','E16','森田奈々','2026-03-19','1','会議経費','U16','U16','2026-03-17 13:01:34','2026-04-03 16:37:16','1',NULL),(17,'2','E17','石井翔','2026-03-20','0','出張経費','U17','U17','2026-03-17 13:01:34','2026-04-03 16:37:16','1',NULL),(18,'2','E18','岩田真央','2026-03-21','1','会議経費','U18','U18','2026-03-17 13:01:34','2026-04-03 16:37:16','1',NULL),(19,'2','E19','田村光','2026-03-22','0','出張経費','U19','U19','2026-03-17 13:01:34','2026-04-03 16:37:16','1',NULL),(20,'2','E20','長谷川莉子','2026-03-23','1','会議経費','U20','U20','2026-03-17 13:01:34','2026-04-03 16:37:23','1',NULL),(21,'2','E21','小田翔','2026-03-24','0','出張経費','U21','U21','2026-03-17 13:01:34','2026-04-03 16:37:23','1',NULL),(22,'2','E22','川口美咲','2026-03-25','1','会議経費','U22','U22','2026-03-17 13:01:34','2026-04-03 16:37:23','1',NULL),(23,'1','E23','藤井健太','2026-03-26','0','出張経費','U23','U23','2026-03-17 13:01:34','2026-04-03 16:37:23','1',NULL),(24,'1','E24','片山彩','2026-03-27','1','会議経費','U24','U24','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(25,'1','E25','横山翔太','2026-03-28','0','出張経費','U25','U25','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(26,'2','E26','中島奈々','2026-03-29','1','会議経費','U26','U26','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(27,'1','E27','森翔','2026-03-30','0','出張経費','U27','U27','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(28,'2','E28','岡田真央','2026-03-31','1','会議経費','U28','U28','2026-03-17 13:01:34','2026-03-19 16:52:14','0',NULL),(29,'2','E29','久保光','2026-03-31','0','出張経費','U29','U29','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(30,'1','E30','村田莉子','2026-03-31','1','会議経費','U30','U30','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(31,'1','E31','安田翔太','2026-03-31','0','出張経費','U31','U31','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(32,'2','E32','中川美咲','2026-03-31','1','会議経費','U32','U32','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(33,'1','E33','福田健太','2026-03-31','0','出張経費','U33','U33','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(34,'2','E34','青木彩','2026-03-31','1','会議経費','U34','U34','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(35,'2','E35','佐々木翔','2026-03-31','0','出張経費','U35','U35','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(36,'1','E36','松井真央','2026-03-31','1','会議経費','U36','U36','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(37,'1','E37','菅原光','2026-03-31','0','出張経費','U37','U37','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(38,'1','E38','中山莉子','2026-03-31','1','会議経費','U38','U38','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(39,'1','E39','堀内翔太','2026-03-31','0','出張経費','U39','U39','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(40,'1','E40','安藤美咲','2026-03-31','1','会議経費','U40','U40','2026-03-17 13:01:34','2026-03-19 17:04:46','0',NULL),(41,'2','E41','川田健太','2026-03-31','0','出張経費','U41','U41','2026-03-17 13:01:34','2026-04-02 16:36:53','1',NULL),(42,'1','E42','三浦彩','2026-04-01','1','会議経費','U42','U42','2026-03-17 13:01:34','2026-04-02 15:11:13','1',NULL),(43,'2','E43','奥田翔','2026-04-01','0','出張経費','U43','U43','2026-03-17 13:01:34','2026-04-02 15:11:13','1',NULL),(44,'1','E44','橋爪真央','2026-04-01','1','会議経費','U44','U44','2026-03-17 13:01:34','2026-04-02 16:36:53','1',NULL),(45,'1','E45','片岡光','2026-04-01','0','出張経費','U45','U45','2026-03-17 13:01:34','2026-04-02 16:36:53','1',NULL),(46,'2','E46','永井莉子','2026-04-01','1','会議経費','U46','U46','2026-03-17 13:01:34','2026-03-23 09:56:34','0',NULL),(47,'1','E47','吉川翔太','2026-04-01','0','出張経費','U47','U47','2026-03-17 13:01:34','2026-03-23 09:56:34','0',NULL),(48,'1','E48','飯田美咲','2026-04-01','1','会議経費','U48','U48','2026-03-17 13:01:34','2026-03-23 09:56:34','0',NULL),(49,'2','E49','原田健太','2026-04-01','0','出張経費','U49','U49','2026-03-17 13:01:34','2026-04-02 16:37:01','1',NULL),(50,'2','E50','小泉彩','2026-04-01','1','会議経費','U50','U50','2026-03-17 13:01:34','2026-04-02 16:37:01','1',NULL);
/*!40000 ALTER TABLE `trx_expense_request` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-04-06 11:02:08
